content.org
#+hugo_base_dir: .
#+hugo_section: posts
#+hugo_auto_set_lastmod: t
* Technical & Strategic Skills
:PROPERTIES:
:EXPORT_HUGO_SECTION: pages
:EXPORT_FILE_NAME: skills
:END:

#+BEGIN_EXPORT html
<div class="skills-grid">
#+END_EXPORT

** Revenue Infrastructure
- **CRM & Automation:** Salesforce (Admin & Experience Cloud), Slack Workflow Builder.
- **Sales Engagement:** Kixie (Routing & Automation), AirCall, FileInvite, ZoomInfo/D&B Hoovers.
- **Intelligence:** Gong.io (Conversation Analytics), ZenDesk.

** Data & Engineering
- **Languages:** Python (Pandas, Plotly, automation scripts), SQL, HTML/CSS.
- **Analysis:** Advanced Google Sheets (Query, VLOOKUP, Dashboarding), Microsoft Excel (Financial Modeling).
- **BI Tools:** DOMO, Tableau.

** Strategy & Frameworks
- **Sales Methodology:** Sandler Consultative Selling (Formally Trained), SPIN Selling.
- **Operations:** Lean Six Sigma / Kanban (Inventory Design), 5-Why Root Cause Analysis.
- **Growth:** Go-to-Market (GTM) Architecture, Full-Cycle Pipeline Management.

#+BEGIN_EXPORT html
</div>
#+END_EXPORT
