content/pages/skills.md
+++
title = "Technical & Strategic Skills"
author = ["desktop"]
lastmod = 2025-12-05T10:09:03-07:00
draft = false
+++

<div class="skills-grid">


## Revenue Infrastructure {#revenue-infrastructure}

-   ****CRM &amp; Automation:**** Salesforce (Admin &amp; Experience Cloud), Slack Workflow Builder.
-   ****Sales Engagement:**** Kixie (Routing &amp; Automation), AirCall, FileInvite, ZoomInfo/D&amp;B Hoovers.
-   ****Intelligence:**** Gong.io (Conversation Analytics), ZenDesk.


## Data &amp; Engineering {#data-and-engineering}

-   ****Languages:**** Python (Pandas, Plotly, automation scripts), SQL, HTML/CSS.
-   ****Analysis:**** Advanced Google Sheets (Query, VLOOKUP, Dashboarding), Microsoft Excel (Financial Modeling).
-   ****BI Tools:**** DOMO, Tableau.


## Strategy &amp; Frameworks {#strategy-and-frameworks}

-   ****Sales Methodology:**** Sandler Consultative Selling (Formally Trained), SPIN Selling.
-   ****Operations:**** Lean Six Sigma / Kanban (Inventory Design), 5-Why Root Cause Analysis.
-   ****Growth:**** Go-to-Market (GTM) Architecture, Full-Cycle Pipeline Management.

</div>
